#include <stdio.h>

int main()
{
	// Задание 1: Вывести на экран “Hello world!”
	printf("Hello world!\n\n");

	// Задание 2: Вывести на экран текст "лесенкой"
	printf("Let's\n");
	printf("   go\n");
	printf("    to walk\n\n");

	// Задание 3: Вывести на экран рисунок из букв
	printf("  *\n");
	printf(" ***\n");
	printf("*****\n");
	printf("*******\n");
	printf(" HH HH\n");
	printf(" ZZZZZ\n\n");

	// Задание 4*: Нарисовать соты
	printf(" __    __\n");
	printf("/  \\__/  \\\n");
	printf("\\__/  \\__/\n");
	printf("/  \\__/  \\\n");
	printf("\\__/  \\__/\n");

	return 0;
}
